writeups/htb/challenges/reverse/rev_spookypass/spookypass.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-05 Mon 21:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SpookyPass</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SpookyPass</h1>
<p class="spacing-64" \>

<p class="spacing-64" \>


<p>
This executable prompts us for a password. Therefore, I guess we have to find
the password it asks for. As usual, I'm going to reverse this binary using Ida
Pro. But, it isn't really needed at all. This challenge is so easy you can just
use the <code>strings</code> command and get the password to get the flag.
</p>
<hr>
<footer>
  <div class="container">
    <ul class="menu-list">
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a href="/index.html">Home</a>
      </li>
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a href="/articles/articles.html">Articles</a>
      </li>
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a href="/writeups/htb/index.html">Write-Ups</a>
      </li>
      <li class="menu-list-item flex-basis-100-margin fit-content">
        <a class="inactive-link">12-01-2025</a>
      </li>
    </ul>
  </div>
</footer>
</div>
</body>
</html>
